<template>
<div class="agree">
<p class="title">软件用户协议 <br>
<p>第一条 特别提示</p>
<ul>
  <li>广州丰盛榜网络科技有限公司（以下简称&ldquo;丰盛榜&rdquo;）在此特别提醒您（用户）在注册成为丰盛榜软件（以下简称&ldquo;本软件&rdquo;）用户之前，请认真阅读本协议《丰盛榜软件许可及服务协议》（以下简称&ldquo;本协议&rdquo;），确保您充分理解本协议中各条款，特别是免除丰盛榜责任的条款及限制您权利的条款。请您审慎阅读并选择接受或不接受本协议。您的注册、登录、使用等行为即视为对本协议的接受，并同意接受本协议各项条款的约束并根据本协议约定享有丰盛榜为您所提供的服务。 </li>
  <li>为了符合国家法律规范的监管要求及本软件运营需要，丰盛榜可以对本协议及相关规则不时地进行修改，修改后的协议条款一旦以任何形式公布即代替原来的协议内容，不再另行通知，您可在丰盛榜网站(<a href="http://www.fshtop.com">http://www.fshtop.com</a>)查阅最新版协议条款。您知悉并确认，如您不同意修改后的内容，请立即停止使用本软件，如您继续使用本软件，即被视为您知悉并同意修改后的内容。 </li>
</ul>
<p>第二条 账号注册及个人信息保护与授权 </p>
<ul>
  <li>您在使用本软件前需要注册一个&ldquo;丰盛榜账号&rdquo;。丰盛榜账号应当使用手机号码绑定注册或关联登录，丰盛榜可以根据您的需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知您。 </li>
  <li>您知悉并确认，您在注册帐号或使用本软件的过程中，需要根据注册提示提供真实有效的身份信息。若您提供的信息不真实、不完整，将导致无法使用本软件或在使用过程中受到限制，因此产生的不利后果，由您自行承担。如果注册申请者有被丰盛榜封禁的先例、涉嫌虚假注册及滥用他人名义注册或其他不能得到注册许可的理由，丰盛榜将拒绝其注册申请。 </li>
  <li>注册成功后，您可以通过本软件中的&ldquo;个人中心&rdquo;界面浏览或更改本人的个人信息，但不能修改系统自动分配给您的ID-&ldquo;丰盛榜号&rdquo;。为了让您获得更好的服务体验，本软件将存储您在使用时的必要信息，包括但不限于您的真实姓名、性别、联系方式等。在未获取您的书面许可的前提下，丰盛榜不会向任何第三方公开、透露您的个人信息，但法律规范规定的情形除外。丰盛榜将采取专业加密的方式对相关信息进行存储与传输，以保障您个人信息的安全。 </li>
  <li>您注册时所填写的个人信息如有变动，您需通过&ldquo;个人中心&rdquo;界面及时更改。 因您未及时更改个人信息造成的损失丰盛榜概不负责。 </li>
</ul>
<p>第三条 软件服务内容 </p>
<ul>
  <li>本软件提供的具体服务内容由丰盛榜根据实际情况提供，包括但不限于视频、商品销售等丰盛榜注册营业范围内的服务。您可以浏览丰盛榜网站(<a href="http://www.fshtop.com">http://www.fshtop.com</a>)了解更多详情。 </li>
  <li>在遵守相关法律规范的前提下，丰盛榜有权决定您在本软件界面上看到的相关内容。 </li>
  <li>对您使用由丰盛榜提供的奖励可兑换的丰盛榜商品及服务的种类与兑换价格，丰盛榜享有最终解释权。 </li>
</ul>
<p>第四条 软件使用规则 </p>
<ul>
  <li>您需从官方渠道下载安装本软件，如您从非官方渠道获取本软件或与本软件名称相同的安装程序，丰盛榜无法保证软件能够正常使用，并对因此给您造成的损失不予负责。 </li>
  <li>为了改善用户体验、完善服务内容，丰盛榜会对本软件及其相关功能不时进行更新，并会对本软件开发新的功能或服务，请您随时核对并下载最新版本。 </li>
  <li>除非法律规范允许或获取丰盛榜书面许可，您使用本软件过程中不得从事下列行为： </li>
  <li>对本软件关于著作权的信息进行删除或修改； </li>
  <li>对本软件进行包括但不限于反向汇编、反向编译等方式尝试获取本软件的源代码； </li>
  <li>对丰盛榜拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等； </li>
  <li>对软件运行中的指令、数据进行修改或伪造，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是为商业目的或非商业目的； </li>
  <li>自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰。 </li>
  <li>您安装运行本软件后，解锁或打开锁屏页面链接、下载应用等均可获取奖励，对具体奖励方式、奖励额度等丰盛榜享有最终解释权。您可以在本软件中查看自己累计的奖励情况。本软件中显示的累计奖励与丰盛榜服务器端存在统计差异的，以服务器端统计数据为准。 </li>
  <li>您的奖励作为本软件中的虚拟记录符号，不能在您与任何第三方间相互转让，不能使用包括人民币在内的任何法定货币购买，不具有在本软件以外的环境中进行交易结算的功能。 </li>
</ul>
<p>第五条 用户行为规范 </p>
<ul>
  <li>本协议依据国家相关法律规范制定，您知悉并同意严格遵守以下约定： </li>
  <li>不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论； </li>
  <li>不得干扰本软件的正常运转，不得侵入本软件及计算机信息系统； </li>
  <li>不得传输或发表：任何违法犯罪的、中伤他人的、辱骂性的、恐吓性的、庸俗的，淫秽的、不文明的等信息资料； </li>
  <li>不得发布任何侵犯他人隐私、个人信息、著作权、商标权等知识产权或合法权益的内容。 </li>
  <li>您须对自己在网上的言论和行为承担法律责任，若您在本软件上发布和传播反动、色情或其它违反国家法律规范的信息，本软件的系统记录有可能将其作为您违反相关法律规范的证据。 </li>
</ul>
<p>第六条 账户安全 </p>
<ul>
  <li>您需自行负责管理您的登陆密码，因您保管不善或计算机系统被破坏等非丰盛榜原因导致账户信息、奖励等泄露、丢失或其他无法正常使用的情况的，由您自行负责。 </li>
  <li>如您没有完成手机号绑定注册流程，仍然继续使用本软件，系统将自动为您分配一个丰盛榜号，该丰盛榜号无需用配套密码登陆。为了您的账户安全，您需尽快完成该丰盛榜号与手机号的绑定。 </li>
  <li>您如果遗失自己的登陆密码，需及时通知丰盛榜，并按照丰盛榜的指引来解决该问题。如果您没有完成丰盛榜号与手机号的绑定导致账户奖励丢失，丰盛榜对此不负任何责任。 </li>
</ul>
<p>第七条 知识产权 </p>
<ul>
  <li>丰盛榜或其合作方拥有本软件及与本软件有关的各种文档资料的著作权、商标权以及其他相关的知识产权。 </li>
  <li>未经丰盛榜或其合作方事先书面同意，您不得为任何营利性或非营利性的目的自行实施、利用、转让或许可任何第三方实施、利用、转让上述知识产权。 </li>
</ul>
<p>第八条 软件服务的变更、中断、终止 </p>
<ul>
  <li>因设备维修或更换、故障和通信中断等技术原因而中断业务，丰盛榜将根据业务中断情况在事前或事后通知您，中断业务时公告将在丰盛榜网站(<a href="http://www.fshtop.com">http://www.fshtop.com</a>)公布。 </li>
  <li>如果因丰盛榜原因临时中断业务而导致您奖励数据丢失，丰盛榜会就您所丢失的奖励给予补偿，对具体补偿奖励数量丰盛榜享有最终解释权。但因不可抗力导致的业务中断发生时,丰盛榜不给予补偿。 </li>
  <li>当您发生如下情况时，丰盛榜可不经通知单方面终止本协议，取消您继续使用本软件的资格： </li>
  <li>身故； </li>
  <li>盗用他人的个人信息或手机； </li>
  <li>注册时提供虚假信息； </li>
  <li>以非法手段（包括但不限于黑客攻击等）来积累或使用积分； </li>
  <li>妨碍其他用户的正常使用； </li>
  <li>出现任何违法行为，根据相关法律规范须取消您继续使用本软件资格的。特别地，如丰盛榜收到与您相关的投诉，且在该等投诉未进一步查清前，丰盛榜有权暂停您对本软件的使用。 </li>
</ul>
<p>第九条 违约责任 </p>
 <ul>
	 <li>您知悉并同意，因您违反本协议或相关条款的规定，导致第三方主张的任何索赔、要求或损失，您应当独立承担责任；如因此导致丰盛榜遭受损失的，您也应当赔偿丰盛榜的损失。 </li>
</ul>
  <p>第十条 法律管辖适用及其他 </p>
<ul>
  <li>本协议的订立、履行和解释及争议的解决均应适用中国法律。如双方就履行本协议过程中发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向丰盛榜所在地人民法院提起诉讼。 </li>
  <li>除非另有明确的书面说明或根据中华人民共和国相关法律规范的规定,丰盛榜不对本软件的运营及其包含在本软件上的资料或服务作任何形式的、明示或默示的声明或担保。 </li>
</ul>
</div>
</template>
<script type="text/ecmascript-6">
import $ from 'zepto';
import client from '../../../common/utils/client';
import Bridge from '../../../common/utils/Bridge';
import apiConfig from '../../../common/api.config';
import { changeTitle } from '../../../common/utils/hack';
import tracker from '../../../common/utils/tracker';
export default {
    data() {
      return {
      }
    },
    components: {
    },
    created () {
      changeTitle('用户协议');
    },
    methods: {
     
    },
	mounted(){
	  	//初次进入本页面浏览
	  	const aboutObj={id:308,title:"软件用户协议",pageName:"用户协议页"};
	  	tracker.firstRead(aboutObj);
	  	tracker.scrollCase({title:"软件用户协议"});
	  	
	}
}
</script>
<style lang="less" >
@import "../../../common/css/common.less";
.agree{
	 text-align:justify;
	 color:#595959;
	 font-size:.16rem;
   line-height:.21rem;
   padding:0 0.24rem 0;
   p.title{
    font-size:.32rem;
    line-height:.45rem;
    color:#4A4A4A;
    padding:.2rem 0;
   }
   ul{
   	margin-bottom:.2rem;
   	li{
   		list-style:none;
   		line-height:.21rem;
   		   a{
   		   	color:#595959;
   		   }
   		}
   }
}
</style>